## Importing module

In [25]:
import re
import spacy
import nltk
from nltk.corpus import stopwords
from nltk.stem import PorterStemmer, WordNetLemmatizer
from nltk.tokenize import word_tokenize

import pandas as pd
import matplotlib.pyplot as plt

## Loading data

In [4]:
bbc_news = pd.read_csv("./datasets/bbc_news.csv")
bbc_news.head()

   Unnamed: 0  ...                                        description
0           0  ...  With much of the UK enduring another period of...
1           1  ...  The UK's political chaos has been watched arou...
2           2  ...  Scoraig in the north west Highlands has long h...
3           3  ...  Wealthy Russians sanctioned by the US, EU and ...
4           4  ...  A quick look back at the Queen's 70 years on t...

[5 rows x 7 columns]

In [5]:
bbc_news.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1000 non-null   int64
 1   index        1000 non-null   int64
 2   title        1000 non-null   object
 3   pubDate      1000 non-null   object
 4   guid         1000 non-null   object
 5   link         1000 non-null   object
 6   description  1000 non-null   object
dtypes: int64(2), object(5)
memory usage: 54.8+ KB

In [12]:
titles = pd.DataFrame(bbc_news["title"])
titles.head()

                                               title
0                              Can I refuse to work?
1  'Liz Truss the Brief?' World reacts to UK poli...
2  Rationing energy is nothing new for off-grid c...
3  The hunt for superyachts of sanctioned Russian...
4  Platinum Jubilee: 70 years of the Queen in 70 ...

## Cleaning data

In [13]:
# lowercase
titles['title_lowercase'] = titles['title'].str.lower()

In [14]:
# stop word removal
en_stopwords = stopwords.words("english")
en_stopwords.remove('not')
titles['title_no_stopwords'] = titles['title_lowercase'].apply(lambda x: ' '.join([word for word in x.split() if word not in en_stopwords]))

In [16]:
# punct removal
titles['title_no_stopwords_punct'] = titles.apply(lambda x: re.sub(r"[^\w\s]", "", x['title_no_stopwords']), axis=1)

In [18]:
# tokenize
titles['title_raw_tokenized'] = titles.apply(lambda x: word_tokenize(x['title']), axis=1)
titles['title_clean_tokenized'] = titles.apply(lambda x: word_tokenize(x['title_no_stopwords_punct']), axis=1)

In [19]:
# lemmatizing
lemmatizer = WordNetLemmatizer()
titles['title_clean_lemmatized'] = titles['title_clean_tokenized'].apply(lambda tokens: [lemmatizer.lemmatize(token) for token in tokens])

In [22]:
titles.head()

                                               title  ...                             title_clean_lemmatized
0                              Can I refuse to work?  ...                                     [refuse, work]
1  'Liz Truss the Brief?' World reacts to UK poli...  ...  [liz, truss, brief, world, reacts, uk, politic...
2  Rationing energy is nothing new for off-grid c...  ...  [rationing, energy, nothing, new, offgrid, com...
3  The hunt for superyachts of sanctioned Russian...  ...  [hunt, superyachts, sanctioned, russian, oliga...
4  Platinum Jubilee: 70 years of the Queen in 70 ...  ...   [platinum, jubilee, 70, year, queen, 70, second]

[5 rows x 7 columns]

In [24]:
# Creating lists for tokens only
token_raw_list = sum(titles['title_raw_tokenized'], [])
token_clean_list = sum(titles['title_clean_lemmatized'], [])

## POS ***(part of speech tag)***

In [ ]:
# Download en_core_web_sm
!python -m spacy download en_core_web_sm

In [32]:
# load the spacy model
nlp = spacy.load("en_core_web_sm")

In [34]:
spacy_doc = nlp(' '.join(token_raw_list))

In [45]:
pos_df = pd.DataFrame(columns= ['token', 'pos_tag'])

In [46]:
for token in spacy_doc:
    pos_df = pd.concat([pos_df, pd.DataFrame.from_records(
        [{'token': token.text, 'pos_tag': token.pos_}])], ignore_index=True)

In [48]:
pos_df_counts = pos_df.groupby(['token', 'pos_tag']).size().reset_index(name='counts').sort_values(by='counts', ascending=False)
pos_df_counts.head(10)

     token pos_tag  counts
94       :   PUNCT     543
7        '   PUNCT     315
2895    in     ADP     187
4072    to    PART     173
3262    of     ADP     172
21       -   PUNCT     165
4033   the     DET     163
1858   and   CCONJ     147
14      's    PART     142
96       ?   PUNCT     130

In [49]:
nouns = pos_df_counts[pos_df_counts.pos_tag == 'NOUN'][:10]
nouns

       token pos_tag  counts
4258     war    NOUN      35
3545  record    NOUN      15
4350    year    NOUN      14
3999     tax    NOUN      13
3411  police    NOUN      13
3362  people    NOUN      12
2323     day    NOUN      12
4307     win    NOUN      11
2029    boss    NOUN      11
2565    fans    NOUN      11

In [50]:
# On cleaned data
spacy_clean_doc = nlp(' '.join(token_clean_list))

In [52]:
pos_clean_df = pd.DataFrame(columns=['token', 'pos_tag'])

In [53]:
for token in spacy_clean_doc:
    pos_clean_df = pd.concat([pos_clean_df, pd.DataFrame.from_records([
        {"token" : token.text, "pos_tag": token.pos_}
    ])], ignore_index=True)

In [55]:
pos_clean_df_counts = pos_clean_df.groupby(['token', 'pos_tag']).size().reset_index(name='counts').sort_values(by='counts', ascending=False)
pos_clean_df_counts.head()

        token pos_tag  counts
3714  ukraine   PROPN      48
30       2022     NUM      47
872       cup   PROPN      45
1168  england   PROPN      45
3955    world   PROPN      38

In [57]:
pos_clean_df_adj_counts = pos_clean_df_counts[pos_clean_df_counts.pos_tag == 'ADJ'][:5]
pos_clean_df_adj_counts

        token pos_tag  counts
2395      new     ADJ      31
3024  russian     ADJ      21
408       big     ADJ      12
1327    first     ADJ      11
2490     open     ADJ      10

## NER ***(Name Entity Recognition)***

In [58]:
ner_df = pd.DataFrame(columns=['token', 'ner_tag'])

In [62]:
for token in spacy_doc.ents:
    if pd.isna(token.label_) is False:
        ner_df = pd.concat([ner_df, pd.DataFrame.from_records([
            {'token': token.text, 'ner_tag': token.label_}
        ])], ignore_index=True)

In [63]:
ner_df[:5]

              token   ner_tag
0         Liz Truss    PERSON
1                UK       GPE
2       superyachts  CARDINAL
3           Russian      NORP
4  Platinum Jubilee    PERSON

In [64]:
ner_df_counts = ner_df.groupby(['token', 'ner_tag']).size().reset_index(name='counts').sort_values(by='counts', ascending=False)

In [65]:
ner_df_counts

                        token ner_tag  counts
984                   Ukraine     GPE      44
978                        UK     GPE      37
320                   England     GPE      34
979                        US     GPE      22
837                   Russian    NORP      21
..                        ...     ...     ...
421                      Gulf     LOC       1
422                   Gunners     GPE       1
423  Gymnast Jessica Gadirova  PERSON       1
424    HRT Women 's World Cup     ORG       1
572  Ludwell Valley Park Tory     LOC       1

[1145 rows x 3 columns]

In [66]:
people = ner_df_counts[ner_df_counts.ner_tag == 'PERSON']
people

                        token ner_tag  counts
780                     Queen  PERSON      11
245                     Covid  PERSON       9
776                     Putin  PERSON       8
163             Boris Johnson  PERSON       6
564                 Liz Truss  PERSON       6
..                        ...     ...     ...
412               Grandmother  PERSON       1
417               Greg Norman  PERSON       1
419         Grieving Russians  PERSON       1
420                 Guardiola  PERSON       1
423  Gymnast Jessica Gadirova  PERSON       1

[407 rows x 3 columns]